Tekla Open API Reference for Tekla Structures 2025
SiteWorkshop Methods
The BoltFilterExpressions.SiteWorkshop type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
BoltFilterExpressions.SiteWorkshop Class
Tekla.Structures.Filtering.Categories Namespace